---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.FlexPipe
source: html/4b0e0656-4760-4a91-a777-ce50869a827a.htm
---
# Autodesk.Revit.DB.Plumbing.FlexPipe

A flex pipe in the Autodesk Revit MEP product.

## Syntax (C#)
```csharp
public class FlexPipe : MEPCurve
```

## Remarks
The flex pipe is only available in the Autodesk Revit MEP product.